{
    "schema_name": "nyc_dob_job",
    "fields": [
        {
            "name": "bin",
            "type": "integer",
            "label": "BIN",
            "description": "The Building Identification Number (BIN) from NYC Department of Buildings"
        },
        {
            "name": "job_number",
            "type": "integer",
            "label": "Job Number",
            "description": "The DOB Job Application Number assigned when the applicant begins the application."
        },
        {
            "name": "document_number",
            "type": "integer",
            "label": "Document Number",
            "description": "A sequential number assigned to each of the documents that make up a job application."
        },
        {
            "name": "job_type_code",
            "type": "text",
            "label": "Job Type Code",
            "description": "2-digit code to indicate the overall job type for the application. Expected values are:  • A1 = Alteration Type I, A major alteration that will change the use, egress, or occupancy of the building. • A2 = Alteration Type II, An application with multiple types of work that do not affect the use, egress, or occupancy of the building. • A3 = Alteration Type III, One type of minor work that doesn't affect the use, egress, or occupancy of the building. • NB = New Building, An application to build a new structure. “NB” cannot be selected if any existing building elements are to remain—for example a part of an old foundation, a portion of a façade that will be incorporated into the construction, etc. • DM = Demolition, An application to fully or partially demolish an existing building. • PA = A Place of Assembly (PA) Certificate of Operation is required for premises where 75 or more members of the public gather indoors or 200 or more gather outdoors, for religious, recreational, educational, political, or social purposes, or to consume food or drink. This type of job filing is related to a NB or A1. • SC = Subdivision Condominiums, The division of a tax lot into several smaller tax lots allowing each condominium to have its own tax lot. • SI = Subdivision Improved, An improved subdivision is when one lot is being broken into several smaller lots. The Department of Finance must assign new lot numbers to subdivisions.U+0022"
        },
        {
            "name": "pre_filing_date",
            "type": "text",
            "label": "Pre-filing Date",
            "description": "The date when a job application # is assigned at this status. This occurs when the applicant submits any part of the application (even a single form), in person or electronically"
        },
        {
            "name": "latest_action_date",
            "type": "text",
            "label": "Latest Action Date",
            "description": "The date of the last update to the DOB record for the job filing"
        },
        {
            "name": "job_status_code",
            "type": "text",
            "label": "Job Status Code",
            "description": "A single letter to indicate the overall status for the job application"
        },
        {
            "name": "job_status_description",
            "type": "text",
            "label": "Job Status Description",
            "description": "The description of the job status code"
        },
        {
            "name": "existing_story_count",
            "type": "integer",
            "label": "Existing Story Count",
            "description": "This is the existing number of floors in the building, as reported by the applicant."
        },
        {
            "name": "existing_zoning_square_feet",
            "type": "integer",
            "label": "Existing Zoning Square Feet",
            "description": "This is the Total Zoning Floor Area for the existing building, if any. This is only required for a Job Type of NB or A1."
        },
        {
            "name": "existing_dwelling_unit_count",
            "type": "text",
            "label": "Existing Dwelling Unit Count",
            "description": "This is the existing number of dwelling units in the building, as reported by the applicant."
        },
        {
            "name": "existing_occupancy_type_code",
            "type": "text",
            "label": "Existing Occupancy Type",
            "description": "A 1-3 character code that indicates the occupancy classification for the building."
        },
        {
            "name": "proposed_story_count",
            "type": "integer",
            "label": "Proposed Story Count",
            "description": "This is the number of floors in the building after the work is done, as reported by the applicant."
        },
        {
            "name": "proposed_zoning_square_feet",
            "type": "integer",
            "label": "Proposed Zoning Square Feet",
            "description": "This is the Total Zoning Floor Area for the building after the proposed work is completed. This is only required for a Job Type of NB or A1."
        },
        {
            "name": "proposed_dwelling_unit_count",
            "type": "text",
            "label": "Proposed Dwelling Unit Count",
            "description": "This is the proposed number of dwelling units in the building after the proposed work has been completed, as reported by the applicant."
        },
        {
            "name": "proposed_occupancy_type_code",
            "type": "text",
            "label": "Proposed Occupancy Type",
            "description": "A 1-3 character code that indicates the occupancy classification for the building after the proposed work has been completed."
        },
        {
            "name": "certificate_of_occupancy_permit_sequence",
            "type": "text",
            "label": "Certificate of Occupancy Permit Sequence",
            "description": "For duplicate job and document numbers, the permit sequence identifies the order in which permits were created"
        },
        {
            "name": "certificate_of_occupancy_job_type_code",
            "type": "text",
            "label": "Certificate of Occupancy Job Type",
            "description": "A Certificate of Occupancy is issued after a new building is built or after a major alteration that affects the use, egress, or type of occupancy of the building. Expected values are: • A1 = Alteration Type I, A major alteration that will change the use, egress, or occupancy of the building. • NB = New Building, An application to build a new structure. "
        },
        {
            "name": "certificate_of_occupancy_work_type_code",
            "type": "text",
            "label": "Certificate of Occupancy Work Type",
            "description": "Type of work associated with the Certificate of Occupancy"
        },
        {
            "name": "certificate_of_occupancy_permit_status",
            "type": "text",
            "label": "Certificate of Occupancy Permit Status",
            "description": "The status of the application for a Certificate of Occupancy"
        },
        {
            "name": "certificate_of_occupancy_filling_date",
            "type": "text",
            "label": "Certificate of Occupancy Filing Date",
            "description": "The filing date of the application for a Certificate of Occupancy"
        },
        {
            "name": "certificate_of_occupancy_filing_status",
            "type": "text",
            "label": "Certificate of Occupancy Filing Status",
            "description": "The filing status of the application for a Certificate of Occupancy"
        },
        {
            "name": "certificate_of_occupancy_job_start_date",
            "type": "text",
            "label": "Certificate of Occupancy Job Start Date",
            "description": "Start date of the job associated with the Certificate of Occupancy"
        },
        {
            "name": "certificate_of_occupancy_historical_issue_date",
            "type": "text",
            "label": "Certificate of Occupancy Historical Issue Date",
            "description": "Date the Certificate of Occupancy was issued"
        },
        {
            "name": "certificate_of_occupancy_expiration_date",
            "type": "text",
            "label": "Certificate of Occupancy Expiration Date",
            "description": "Expiration date of the Certificate of Occupancy"
        }
    ]
}